Repository: Huevos/SatScanLcn
Catalog: SatScanLcn/po/*.po
Languages: pl, ru

source: %s region
ru: %s регион

source: About
pl: O wtyczce
ru: О плагине

source: Advanced options
pl: Zaawansowane
ru: Доп. настройки

source: Bouquets generation...
pl: Generowanie bukietów...
ru: Создание букетов...

source: CAUTION: Sometimes the SI tables contain rogue data. Select "yes" to sync with transponder data listed in satellites.xml. Select "no" if you trust the SI data. Default is "no". Only change this if you understand why you are doing it.
pl: UWAGA: Czasami tabele SI zawierają błędne dane. Wybierz "Tak", aby zsynchronizować się z danymi transpondera wymienionymi w satellites.xml. Wybierz "Nie" jeśli ufasz danym SI. Domyślne ustawienia "Nie". Zmień tylko, jeśli rozumiesz dlaczego to robisz.
ru: ВНИМАНИЕ: Иногда таблицы SI (информация о канале) содержат неверные данные. Выберите 'Да' чтобы синхронизироваться с данными транспондеров из satellites.xml. Значение по умолчанию - 'Нет'. Не меняйте его, если не понимаете точно, зачем это надо.

source: CAUTION: This feature is for development only. Requires debug logs to be enabled or enigma2 to be started in console mode (at debug level 4).
pl: UWAGA: Ta funkcja jest przeznaczona tylko dla deweloperów. Wymaga włączenia logów debugowania lub uruchomienia enigma2 w trybie konsoli (na poziomie debugowania 4).
ru: ВНИМАНИЕ: Эта функция предназначена только для разработчиков. Необходимо включить запись журналов отладки или запустить Enigma2 в консоли (с уровнем отладки 4).

source: Cancel
pl: Anuluj
ru: Отменить

source: Cannot allocate the demuxer.
pl: Nie można przydzielić demultipleksera.
ru: Невозможно выделить демультиплексор.

source: Cannot free NIM because a recording is in progress
pl: Nie można zwolnić NIM, ponieważ trwa zapisywanie
ru: Невозможно освободить NIM потому что сейчас идет запись

source: Cannot get frontend
pl: Nie można uzyskać frontendu
ru: Невозможно получить фронтенд

source: Cannot get the NIM
pl: Nie można pobrać NIT
ru: Невозможно получить NIM

source: Cannot open the demuxer
pl: Nie można uruchomić demultiplekstera
ru: Невозможно открыть демультиплексор

source: Cannot retrieve Resource Manager instance
pl: Nie można pobrać instancji menedżera zasobów
ru: Невозможно получить менеджер ресурсов

source: Close
pl: Zamknij
ru: Закрыть

source: Could not acquire the correct tsid/onid on the home transponder.
pl: Nie można uzyskać prawidłowego tsid/onid na transponderze macierzystym.
ru: Не удалось получить правильные tsid/onid с домашнего транспондера.

source: Current settings read...
pl: Odczyt aktualnych ustawień
ru: Чтение текущих настроек...

source: Done
pl: Zrobione
ru: Готово

source: Exit
pl: Wyjdź
ru: Выход

source: Extra debug
pl: Dodatkowe debugowanie
ru: Расширенная отладка

source: FTA only
pl: Tylko FTA
ru: Только открытые

source: Force channel name
pl: Wymuś nazwę kanału
ru: Принудительно добавлять имя канала

source: Grab LCN bouquets from the DVB stream.
pl: Pobierz bukiety LCN ze strumienia DVB.
ru: Создание букета оператора

source: HD only
pl: Tylko HD
ru: Только HD

source: Last Scanned
pl: Ostatnie skanowanie
ru: Последние результаты сканирования

source: No compatible tuner found
pl: Tuner nie kompatybilny
ru: Не найден совместимый тюнер

source: No valid NIM found for %s
pl: Nie znaleziono prawidłowego NIM dla %s
ru: Не найден корректный NIM для %s

source: Only include free to air channels.
pl: Uwzględnij tylko kanały FTA.
ru: Искать только открытые каналы.

source: Only include high definition channels.
pl: Uwzględnij tylko kanały HD.
ru: Искать только каналы высокого разрешения.

source: Only one instance of each channel appears in the bouquet. If any channel is found to have multiple LCNs the lowest LCN numerically will be selected.
pl: W bukiecie pojawia się tylko jedno wystąpienie każdego kanału. Jeśli okaże się, że jakikolwiek kanał ma wiele LCN, wybrany zostanie najniższy numer LCN.
ru: Каждый канал появится в букете только один раз. Если какой нибудь из каналов имеет несколько логических номеров канала (LCN), то выбирается наименьший из номеров.

source: Provider
pl: Nadawca
ru: Оператор

source: Read %s %s %s %s...
pl: Odczyt %s %s %s %s...
ru: Чтение %s %s %s %s...

source: Reading bouquet allocation table...
pl: Czytanie tabeli alokacji bukietów...
ru: Чтение таблицы распределения по букетам...

source: Reading current settings...
pl: Odczytywanie obecnych ustawień
ru: Чтение текущих настроек...

source: Really close without saving settings?
pl: Zamknąć bez zapisu ustawień?
ru: Действительно закрыть без сохранения настроек?

source: Sat Scan LCN
ru: Поиск по спутниковому оператору

source: Application credits:
ru: Автор плагина:

source: Sources credits (dvbreader):
ru: Авторы кода (dvbreader):

source: SatScanLCN expands on the JoyneScan plugin and uses the same dvbreader as ABM, but unlike ABM it is able to scan the Service Descriptor Table of multiple transponders based on the content of the Network Identification Table on the home transponder. This means providers such as Joyne (now defunct) or Orange TV on 16E that don't contain complete SDT data on the home transponder can still be successfully scanned.
ru: Плагин SatScanLCN расширяет возможности плагина JoyneScan и использует тот же самый dvbreader что и ABM, но в отличие от ABM может сканировать таблицу дескрипторов канала (SDT) множества транспондеров на основе содержимого таблицы идентификаторов сети (Network Identification Table) домашнего транспондера. Это дает возможно успешно сканировать каналы таких операторов как Joyne (более не существует) или Orange TV на спутнике 16E, не предоставляющих полных данных SDT на своем домашнем транспондере.

source: SatScanLCN grabs one simple bouquet of the selected provider and adds it to the top of the channel list. The bouquet can be moved using enigma's built in controls and will stay put on a rescan. To remove any bouquet created by this tool use enigma's built in controls.
pl: SatScanLCN pobiera bukiet wybranego dostawcy i dodaje go do listy kanałów. Bukiet może być przenoszony za pomocą wbudowanych kontrolek enigmy i pozostanie na miejscu podczas ponownego skanowania. Aby usunąć bukiet utworzony przez to narzędzie należy użyć wbudowanych kontrolek enigmy.
ru: Плагин SatScanLCN создает один простой букет каналов выбранного оператора и добавляет его в начало списка каналов. Этот букет можно перемещать с помощью встроенных функций Enigma, и он будет сохраняться при повторном поиске каналов. Удалить созданные этим инструментом букеты можно стандартными средствами Enigma.

source: SatScanLCN is not meant to deprecate, replace, substitute, supersede or usurp any current bouquet creation tool.
pl: SatScanLCN nie ma na celu deprecjonowania, zastąpienia, substytucji lub uzurpacji do jakiegokolwiek obecnego narzędzia do tworzenia bukietów.
ru: SatScanLCN не заменяет и не планирует заменить другие инструменты создания букетов.

source: SatScanLcn
ru: Поиск по спутниковому оператору

source: Save
pl: Zapisz
ru: Сохранить

source: Scan
pl: Skanuj
ru: Поиск

source: Scans for services and creates a bouquet
pl: Skanuj serwisy i utwórz bukiet
ru: Поиск каналов и создание букета спутникового оператора

source: Searching for transponders...
pl: Wyszukuję transpondery...
ru: Идет поиск транспондеров...

source: Select the %s region to scan.
pl: Wybierz region %s do skanowania
ru: Выберите регион %s для сканирования.

source: Select the provider you wish to scan.
pl: Wybierz dostawcę którego chcesz skanować.
ru: Выберите оператора, чьи каналы хотите сканировать.

source: Services: %d video - %d radio
pl: Serwisy: %d wideo - %d radio
ru: Каналы: %d видео - %d радио

source: Setup
pl: Ustawienia
ru: Настройка

source: Show in extensions menu
pl: Pokaż w menu rozszerzeń
ru: Показывать в меню расширений

source: Something went terribly wrong
pl: Coś poszło nie tak
ru: Что-то пошло не так

source: Starting scanner
pl: Uruchamiam skaner
ru: Начинается сканирование

source: Switch this on only if you have issues with "N/A" appearing in your channel list. Switching this on means the channel name will not auto update if the broadcaster changes the channel name.
pl: Włącz tę opcję tylko w przypadku problemów z pojawieniem się "N/A" twojej na liście kanałów. Włączenie tej opcji oznacza, że nazwa kanału nie będzie automatycznie aktualizowana, jeśli nadawca zmieni nazwę kanału.
ru: Включайте только если в вашем списке каналов появляются строки 'N/A'. Включение означает, что имя канала не будет автоматически обновлено, если оператор его изменит.

source: Sync with known transponders
pl: Synchronizacja z znanych transponderów
ru: Синхронизировать с известными транспондерами

source: Telekom Romania
ru: TelekTelekom Romaniaom Romania

source: The bouquet is ordered exactly according to the Logical Channel Number data carried on the DVB stream. No cleanups, swaps or other manipulations are carried out. And no customisation of the produced bouquets is possible. If that is what is required please use ABM.
pl: Bukiet jest uporządkowany dokładnie według danych LCN pobranych ze strumienia DVB. Nie przeprowadza się żadnych porządków, zamian ani innych manipulacji. Nie jest możliwa personalizacja pobranych bukietów. Jeśli jest to wymagane, użyj ABM.
ru: Каналы в букете расставляются в точном соответствии с данными логической нумерации каналов (LCN), которые содержатся в DVB-потоке. Никаких чисток, перестановок или других вмешательств не делается. Редактировать полученные букеты нельзя. Если это необходимо, используйте ABM.

source: Timeout for tuner lock on %s
pl: Upłynął limit czasu na lock on tunera %s
ru: Истекло время ожидания тюнером сигнала %s

source: To grab multiple bouquets just run the application multiple times.
pl: Aby pobrać wiele bukietów, po prostu uruchom aplikację wiele razy.
ru: Чтобы создать несколько букетов, просто запустите программу несколько раз.

source: Tune %s %s %s %s...
pl: Dostrajanie %s %s %s %s...
ru: Настройка %s %s %s %s...

source: Tuning failed on %s
pl: Nie udane dostrajanie z %s
ru: Настройка на %s не удалась

source: When enabled, this allows you start a SatScanLcn update from the extensions list.
pl: Po włączeniu pozwala na rozpoczęcie aktualizacji SatScanLcn z listy rozszerzeń.
ru: Позволяет запускать обновление нумерации спутниковых каналов из списка расширений.

source: transponders found: %d
pl: znalezione transpondery: %d
ru: найдено транспондеров: %d

source: SatScanLCN expands on the JoyneScan plugin and uses the same dvbreader as ABM, but unlike ABM it is able to scan the Service Descriptor Table of multiple transponders based on the content of the Network Identification Table on the home transponder. This means providers such as Joyne ( now defunct) or Orange TV on 16E that don't contain complete SDT data on the home transponder can still be successfully scanned.
pl: SatScanLCN to rozszerzenie wtyczki JoyneScan i używa tego samego dvbreadera co ABM(AutoBouquetMaker), ale w przeciwieństwie do ABM jest w stanie skanować SDT (Tabelę Deskrypji Usług) wielu transponderów w oparciu o zawartość TID (Tabeli Identyfikacji Sieci) na transponderze macierzystym. Oznacza to, że dostawcy tacy jak Joyne (obecnie nieistniejący) lub Orange TV na 16E, którzy nie posiadają kompletnych danych SDT na transponderze macierzystym, mogą być nadal skutecznie skanowani.
